## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 8 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cartography_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cartography_policies"  {
      ~ id      = "3043168721" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::722713121070:role/AssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/AssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudwatch_log_group.cartography_flow_log will be destroyed
  # (because aws_cloudwatch_log_group.cartography_flow_log is not in configuration)
  - resource "aws_cloudwatch_log_group" "cartography_flow_log" {
      - arn               = "arn:aws:logs:ca-central-1:794722365809:log-group:cartography_flow_log" -> null
      - id                = "cartography_flow_log" -> null
      - name              = "cartography_flow_log" -> null
      - retention_in_days = 14 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_flow_log.cartography will be destroyed
  # (because aws_flow_log.cartography is not in configuration)
  - resource "aws_flow_log" "cartography" {
      - arn                      = "arn:aws:ec2:ca-central-1:794722365809:vpc-flow-log/fl-006906c0fa3649d2d" -> null
      - iam_role_arn             = "arn:aws:iam::794722365809:role/secopsAssetInventoryCartographyRole" -> null
      - id                       = "fl-006906c0fa3649d2d" -> null
      - log_destination          = "arn:aws:logs:ca-central-1:794722365809:log-group:cartography_flow_log" -> null
      - log_destination_type     = "cloud-watch-logs" -> null
      - log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> null
      - log_group_name           = "cartography_flow_log" -> null
      - max_aggregation_interval = 600 -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - traffic_type             = "ALL" -> null
      - vpc_id                   = "vpc-00a43e63b345ba0ce" -> null
    }

  # aws_flow_log.cloud-based-sensor will be created
  + resource "aws_flow_log" "cloud-based-sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-794722365809/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-00a43e63b345ba0ce"
    }

  # aws_iam_policy.cartography_policies will be updated in-place
  ~ resource "aws_iam_policy" "cartography_policies" {
        id        = "arn:aws:iam::794722365809:policy/CartographyTaskExecutionPolicies"
        name      = "CartographyTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::722713121070:role/AssetInventorySecurityAuditRole",
                          - "arn:aws:iam::028051698106:role/AssetInventorySecurityAuditRole",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/neo4j_auth",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_user",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/elasticsearch_password",
                          - "arn:aws:ssm:ca-central-1:794722365809:parameter/cartography/asset_inventory_account_list",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.cartography will be updated in-place
  ~ resource "aws_security_group" "cartography" {
        id                     = "sg-0146ac8de4816d72c"
        name                   = "cartography"
      ~ tags                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.load_balancer will be updated in-place
  ~ resource "aws_security_group" "load_balancer" {
        id                     = "sg-008eb2c3b580ab592"
        name                   = "load_balancer"
      ~ tags                   = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all               = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.asset_inventory_account_list will be updated in-place
  ~ resource "aws_ssm_parameter" "asset_inventory_account_list" {
        id        = "/cartography/asset_inventory_account_list"
        name      = "/cartography/asset_inventory_account_list"
      ~ tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.elasticsearch_password will be updated in-place
  ~ resource "aws_ssm_parameter" "elasticsearch_password" {
        id              = "/cartography/elasticsearch_password"
        name            = "/cartography/elasticsearch_password"
      ~ tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.elasticsearch_user will be updated in-place
  ~ resource "aws_ssm_parameter" "elasticsearch_user" {
        id        = "/cartography/elasticsearch_user"
        name      = "/cartography/elasticsearch_user"
      ~ tags      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.neo4j_auth will be updated in-place
  ~ resource "aws_ssm_parameter" "neo4j_auth" {
        id              = "/cartography/neo4j_auth"
        name            = "/cartography/neo4j_auth"
      ~ tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.neo4j_password will be updated in-place
  ~ resource "aws_ssm_parameter" "neo4j_password" {
        id              = "/cartography/neo4j_password"
        name            = "/cartography/neo4j_password"
      ~ tags            = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      ~ tags_all        = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 2 to destroy.

Changes to Outputs:
  + cloud_asset_inventory_vpc_id = "vpc-00a43e63b345ba0ce"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
